In [1]:
import pandas as pd
# pd is context  manager

In [2]:
a = [4,5,6]
myvar = pd.Series(a)
print(myvar)

0    4
1    5
2    6
dtype: int64

In [3]:
a = [4,5,6]
myvar = pd.Series(a,index = ["x","y","z"])
print(myvar)

x    4
y    5
z    6
dtype: int64

In [4]:
print(myvar["y"])

5

In [5]:
print(myvar[1])

5

C:\Users\HP\AppData\Local\Temp\ipykernel_4180\2320585734.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(myvar[1])

In [6]:
calories = {"day1":420,"day2":380,"day3":390}

myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [7]:
#every key will be an index position
print(myvar['day2'])

380

In [8]:
print(myvar[1])

380

C:\Users\HP\AppData\Local\Temp\ipykernel_4180\2320585734.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(myvar[1])

In [9]:
calories = {"day1":420,"day2":380,"day3":390}

myvar = pd.Series(calories,index=["day1","day2","day4"])
print(myvar)

day1    420.0
day2    380.0
day4      NaN
dtype: float64

## Dataframe:2D

In [10]:
data = {
    "calories":[420,380,390],
    "duration":[50,40,45]
    }
df = pd.DataFrame(data)
print(df)
df.shape

   calories  duration
0       420        50
1       380        40
2       390        45

(3, 2)

In [11]:
data = {
    "calories":[420,380,390],
    "duration":[50,40,45]
    }
df = pd.DataFrame(data,index=["day1","day2","day3"])
print(df)
df.shape

      calories  duration
day1       420        50
day2       380        40
day3       390        45

(3, 2)

In [12]:
# calories = {"day1":420,"day2":380,"day3":390}
# df = pd.DataFrame(calories)
# df

In [13]:
calories = {"day1":420,"day2":380,"day3":390}
df = pd.DataFrame(calories,index=[1])
df

   day1  day2  day3
1   420   380   390

In [14]:
# list into dataframe

lst = ["My","name","is","nikhil","garg"]

df = pd.DataFrame(lst)
df

        0
0      My
1    name
2      is
3  nikhil
4    garg

In [15]:
# list into dataframe

lst = ["My","name","is","nikhil","garg"]

df = pd.DataFrame(lst,columns=["details"])
df

  details
0      My
1    name
2      is
3  nikhil
4    garg

In [16]:
#joining multiple lists
lst1 = ["My","name","is","nikhil","garg"]
lst2 = [2,4,8,9,6]

list(zip(lst1,lst2)) #tuple inside list

[('My', 2), ('name', 4), ('is', 8), ('nikhil', 9), ('garg', 6)]

In [17]:
#convert multiple list into dataframe

lst1 = ["My","name","is","nikhil","garg"]
lst2 = [2,4,5,6,7]

df = pd.DataFrame(list(zip(lst1,lst2)),columns=["Details","Val"])
df

  Details  Val
0      My    2
1    name    4
2      is    5
3  nikhil    6
4    garg    7

In [18]:
#converting list of list (multidimensional) into dataframe
lst = [['nikhil',36],['rupail',30],["deep",28],["prithvish",35]]
df = pd.DataFrame(lst,columns=["Name","Age"])
df

        Name  Age
0     nikhil   36
1     rupail   30
2       deep   28
3  prithvish   35

In [19]:
import pandas as pd

In [20]:
titanic = pd.read_csv("titanic.csv")
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [21]:
titanic.shape

(1309, 14)

In [22]:
titanic.head()
# print default top 5 rows

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [23]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [24]:
titanic.tail()
# print default bottom 5 rows

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [25]:
titanic.tail(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.225,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.875,NaN,S,NaN,NaN,NaN

In [26]:
#exploration of categorical columns
titanic["pclass"].unique()

array([1, 2, 3])

In [27]:
#summary of dataframe
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [28]:
ages = titanic[['age']]
ages.head()

     age
0  29.00
1   0.92
2   2.00
3  30.00
4  25.00

In [29]:
type(ages)

pandas.core.frame.DataFrame

In [30]:
ages.shape

(1309, 1)

In [31]:
age_sex = titanic[["age","sex"]]
age_sex.head()

     age     sex
0  29.00  female
1   0.92    male
2   2.00  female
3  30.00    male
4  25.00  female

In [32]:
age_sex.shape

(1309, 2)

In [33]:
type(age_sex)

pandas.core.frame.DataFrame

### Filter row based on some condition

In [34]:
titanic[titanic["age"]>35]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [35]:
above_35=titanic[titanic["age"]>35]
above_35

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [36]:
above_35=titanic[(titanic["age"]> 35) & (titanic["age"] <60 )]
above_35

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
10,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [37]:
above_35.reset_index()

,index,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
1,7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
2,8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
3,10,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
4,17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
277,1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
278,1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
279,1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
280,1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
281,1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [38]:
above_35.reset_index().drop("index",axis=1)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
1,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
2,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
3,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
4,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
277,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
278,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
279,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
280,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
281,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [39]:
pclass_23=titanic[(titanic["pclass"]==2) | (titanic["pclass"]==3)]
pclass_23

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
323,2,0,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C,NaN,NaN,"Russia New York, NY"
324,2,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C,10,NaN,"Russia New York, NY"
325,2,0,"Aldworth, Mr. Charles Augustus",male,30.0,0,0,248744,13.0000,NaN,S,NaN,NaN,"Bryn Mawr, PA, USA"
326,2,0,"Andrew, Mr. Edgardo Samuel",male,18.0,0,0,231945,11.5000,NaN,S,NaN,NaN,"Buenos Aires, Argentina / New Jersey, NJ"
327,2,0,"Andrew, Mr. Frank Thomas",male,25.0,0,0,C.A. 34050,10.5000,NaN,S,NaN,NaN,"Cornwall, England Houghton, MI"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [40]:
#isin #pclass: 1,2,3 (categorical)
#whether each element in the dataframe is contained in value
#passengers from cabin class 2 and 3

class_23 = titanic[titanic["pclass"].isin([2,3])]
class_23

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
323,2,0,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C,NaN,NaN,"Russia New York, NY"
324,2,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C,10,NaN,"Russia New York, NY"
325,2,0,"Aldworth, Mr. Charles Augustus",male,30.0,0,0,248744,13.0000,NaN,S,NaN,NaN,"Bryn Mawr, PA, USA"
326,2,0,"Andrew, Mr. Edgardo Samuel",male,18.0,0,0,231945,11.5000,NaN,S,NaN,NaN,"Buenos Aires, Argentina / New Jersey, NJ"
327,2,0,"Andrew, Mr. Frank Thomas",male,25.0,0,0,C.A. 34050,10.5000,NaN,S,NaN,NaN,"Cornwall, England Houghton, MI"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [41]:
titanic.dropna(subset="age") # same as below code (but dropna is more used)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1301,3,0,"Youseff, Mr. Gerious",male,45.50,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [42]:
# notna #i want to work with passenger data for which age is known
#notna is a boolean inverse of isna
age_no_na = titanic[titanic["age"].notna()]
age_no_na

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1301,3,0,"Youseff, Mr. Gerious",male,45.50,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

### Fetching rows and columns (Slicing)

1. fetch the row and columns on the basis of index positions: iloc
2. fetch the rows and columns on the basis of labels(row as well as column labels):loc

In [43]:
import pandas as pd

In [44]:
brics = pd.read_csv("brics.csv",index_col=0)
brics

           country    capital    area  population
Code
BR          Brazil   Brasilia   8.516      200.40
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
CH           China    Beijing   9.597     1357.00
SA    South Africa   Pretoria   1.221       52.98

In [45]:
brics.shape

(5, 4)

In [46]:
brics.loc[["RU"]]# RU is the row label of second row

     country capital  area  population
Code
RU    Russia  Moscow  17.1       143.5

In [47]:
brics.loc[["RU","IN","SA"]]

           country    capital    area  population
Code
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
SA    South Africa   Pretoria   1.221       52.98

In [48]:
# select both row and column [row,columns]
brics.loc[["RU","IN","SA"],["country","capital"]]

           country    capital
Code
RU          Russia     Moscow
IN           India  New Delhi
SA    South Africa   Pretoria

In [49]:
brics.loc[:,["country","capital"]]

           country    capital
Code
BR          Brazil   Brasilia
RU          Russia     Moscow
IN           India  New Delhi
CH           China    Beijing
SA    South Africa   Pretoria

In [50]:
brics.loc[["RU","IN","SA"],:]

           country    capital    area  population
Code
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
SA    South Africa   Pretoria   1.221       52.98

In [51]:
brics.iloc[[0,1,2],[0,1]]

     country    capital
Code
BR    Brazil   Brasilia
RU    Russia     Moscow
IN     India  New Delhi

In [52]:
brics.iloc[:,[2,3]]

        area  population
Code
BR     8.516      200.40
RU    17.100      143.50
IN     3.286     1252.00
CH     9.597     1357.00
SA     1.221       52.98

In [53]:
brics.iloc[[3,4],:]

           country   capital   area  population
Code
CH           China   Beijing  9.597     1357.00
SA    South Africa  Pretoria  1.221       52.98

In [54]:
brics.duplicated()

Code
BR    False
RU    False
IN    False
CH    False
SA    False
dtype: bool

In [55]:
df = pd.DataFrame({"brand":['yum','yum','ind'],
                   "style":['cup','cup','bottle']})
df

  brand   style
0   yum     cup
1   yum     cup
2   ind  bottle

In [56]:
df.duplicated()

0    False
1     True
2    False
dtype: bool

In [57]:
df.drop_duplicates()

  brand   style
0   yum     cup
2   ind  bottle

In [58]:
df = pd.DataFrame({"brand":['yum','yum','ind'],
                   "style":['cup','bottle','bottle']})
df

  brand   style
0   yum     cup
1   yum  bottle
2   ind  bottle

In [59]:
df.duplicated()

0    False
1    False
2    False
dtype: bool

In [60]:
df.drop_duplicates(subset="brand")

  brand   style
0   yum     cup
2   ind  bottle

In [61]:
df.drop_duplicates(subset="brand").reset_index()

   index brand   style
0      0   yum     cup
1      2   ind  bottle

In [62]:
brics

           country    capital    area  population
Code
BR          Brazil   Brasilia   8.516      200.40
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
CH           China    Beijing   9.597     1357.00
SA    South Africa   Pretoria   1.221       52.98

In [63]:
brics.loc["BR","country"]="brasil"   # not majorly used

In [64]:
brics

           country    capital    area  population
Code
BR          brasil   Brasilia   8.516      200.40
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
CH           China    Beijing   9.597     1357.00
SA    South Africa   Pretoria   1.221       52.98

### How to create new columns derived from existing columns

In [65]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [66]:
titanic["fare"] = titanic["fare"] /10
# modification done in existing column

In [67]:
titanic['modified_fare'] = titanic["fare"] /10
# generate new column

In [68]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,21.13375,B5,S,2,NaN,"St Louis, MO",2.113375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,15.15500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1.515500

In [69]:
# renaming of columns
titanic_rename = titanic.rename(columns={"sex":"gender","name":"full name"})
titanic_rename.head(2)

,pclass,survived,full name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,21.13375,B5,S,2,NaN,"St Louis, MO",2.113375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,15.15500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1.515500

In [70]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,21.13375,B5,S,2,NaN,"St Louis, MO",2.113375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,15.15500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1.515500

In [71]:
titanic_rename.rename(columns= str.upper,inplace=True)  # inplace mean data save without using any variable
titanic_rename.head(2)

,PCLASS,SURVIVED,FULL NAME,GENDER,AGE,SIBSP,PARCH,TICKET,FARE,CABIN,EMBARKED,BOAT,BODY,HOME.DEST,MODIFIED_FARE
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,21.13375,B5,S,2,NaN,"St Louis, MO",2.113375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,15.15500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1.515500

## Statistical Exploration on Dataframe

Done by data visualization and
statistical analysis

Descriptive statistics i.e. basic statistical metrics

10,15,20,30,45,50,63

mean(average) = sum of all observations

median = centre most value in a sorted data = 30

mode = most occuring item-categorical column

min
max
count

In [72]:
titanic[["age","fare"]].mean()

age     29.881138
fare     3.329548
dtype: float64

In [73]:
titanic[["age","fare"]].median()

age     28.00000
fare     1.44542
dtype: float64

In [74]:
titanic[["age","fare"]].describe() # continous column

               age         fare
count  1046.000000  1308.000000
mean     29.881138     3.329548
std      14.413493     5.175867
min       0.170000     0.000000
25%      21.000000     0.789580
50%      28.000000     1.445420
75%      39.000000     3.127500
max      80.000000    51.232920

In [75]:
titanic["sex"].describe() # categorical column

count     1309
unique       2
top       male
freq       843
Name: sex, dtype: object

In [76]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body,modified_fare
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000,1308.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,3.329548,160.809917,0.332955
std,0.837836,0.486055,14.413493,1.041658,0.865560,5.175867,97.696922,0.517587
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000,0.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,0.789580,72.000000,0.078958
50%,3.000000,0.000000,28.000000,0.000000,0.000000,1.445420,155.000000,0.144542
75%,3.000000,1.000000,39.000000,1.000000,0.000000,3.127500,256.000000,0.312750
max,3.000000,1.000000,80.000000,8.000000,9.000000,51.232920,328.000000,5.123292

In [77]:
titanic.agg({"age":["count","min","max","mean"],"fare":['min','max','median']})
# agg - aggregate

                age      fare
count   1046.000000       NaN
min        0.170000   0.00000
max       80.000000  51.23292
mean      29.881138       NaN
median          NaN   1.44542

In [78]:
#what  is the average age for male vs female titanic passenger?
#sex and age #mean
#aggregate statisctics grouped the category: sex
#groupby

In [79]:
titanic[['sex','age']].groupby('sex').mean()

              age
sex
female  28.687088
male    30.585228

In [80]:
titanic.groupby('sex') [['age']].mean()

              age
sex
female  28.687088
male    30.585228

In [81]:
titanic.groupby('pclass')[['fare']].mean()

            fare
pclass
1       8.750899
2       2.117920
3       1.330289

In [82]:
titanic.groupby(['sex','pclass'])[['fare']].mean() # the column which has less categorical entry put first example sex first then pclass

                    fare
sex    pclass
female 1       10.941238
       2        2.323483
       3        1.532425
male   1        6.988838
       2        1.990495
       3        1.241546

In [83]:
titanic.groupby(['sex','pclass']) [['age','fare']].mean()

                     age       fare
sex    pclass
female 1       37.037594  10.941238
       2       27.499223   2.323483
       3       22.185329   1.532425
male   1       41.029272   6.988838
       2       30.815380   1.990495
       3       25.962264   1.241546

In [84]:
titanic.groupby(['sex','pclass']).agg({'fare':['mean','median'],'age':['mean','min']})

                    fare                  age
                    mean    median       mean   min
sex    pclass
female 1       10.941238  8.092915  37.037594  2.00
       2        2.323483  2.300000  27.499223  0.92
       3        1.532425  1.048960  22.185329  0.17
male   1        6.988838  4.950420  41.029272  0.92
       2        1.990495  1.300000  30.815380  0.67
       3        1.241546  0.789580  25.962264  0.33

In [85]:
titanic["pclass"].value_counts()

pclass
3    709
1    323
2    277
Name: count, dtype: int64

In [86]:
titanic["sex"].value_counts()

sex
male      843
female    466
Name: count, dtype: int64

In [87]:
titanic.sort_values(by="age",ascending=False).head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,3.00000,A23,S,B,NaN,"Hessle, Yorks",0.300000
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,7.88500,C46,S,6,NaN,"Little Onn Hall, Staffs",0.788500
1235,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,0.77750,NaN,S,NaN,NaN,NaN,0.077750
135,1,0,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,3.46542,A5,C,NaN,NaN,"New York, NY",0.346542
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,4.95042,NaN,C,NaN,22.0,"Montevideo, Uruguay",0.495042

In [88]:
titanic.sort_values(by=["pclass","age"],ascending=False).head()   # categorical values should be put first then continius values

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
1235,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,0.77750,NaN,S,NaN,NaN,NaN,0.077750
727,3,0,"Connors, Mr. Patrick",male,70.5,0,0,370369,0.77500,NaN,Q,NaN,171.0,NaN,0.077500
782,3,0,"Duane, Mr. Frank",male,65.0,0,0,336439,0.77500,NaN,Q,NaN,NaN,NaN,0.077500
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,0.95875,NaN,S,15,NaN,NaN,0.095875
1068,3,0,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,0.62375,NaN,S,NaN,NaN,NaN,0.062375

### data.csv

In [89]:
import numpy as np

df = pd.read_csv("data.csv")
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [91]:
df.isna().any()

Duration    False
Pulse       False
Maxpulse    False
Calories     True
dtype: bool

In [92]:
df.isna().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [93]:
dfnew = df.dropna()
dfnew.shape

(164, 4)

In [94]:
dfnew.isna().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [95]:
df['Calories'].fillna(420,inplace=True)
# fill all the nan value with 420

C:\Users\HP\AppData\Local\Temp\ipykernel_4180\1653555657.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Calories'].fillna(420,inplace=True)

In [96]:
dfnew.isna().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [97]:
df[df['Calories']==420]

     Duration  Pulse  Maxpulse  Calories
17         45     90       112     420.0
27         60    103       132     420.0
91         45    107       137     420.0
118        60    105       125     420.0
141        60     97       127     420.0

In [98]:
import pandas as pd
df = pd.read_csv('data.csv')
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [99]:
x = df['Calories'].mean()
x
df['Calories'].fillna(x,inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_4180\186514089.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Calories'].fillna(x,inplace=True)

In [100]:
df.isna().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [101]:
df[df['Calories']== x]

     Duration  Pulse  Maxpulse    Calories
17         45     90       112  375.790244
27         60    103       132  375.790244
91         45    107       137  375.790244
118        60    105       125  375.790244
141        60     97       127  375.790244

In [102]:
import pandas as pd
df = pd.read_csv('data.csv')
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [103]:
y = df['Calories'].median()
print(y)
df['Calories'].fillna(y,inplace=True)

318.6

C:\Users\HP\AppData\Local\Temp\ipykernel_4180\144421977.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Calories'].fillna(y,inplace=True)

In [104]:
df.isna().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [105]:
df[df['Calories']==y]

     Duration  Pulse  Maxpulse  Calories
17         45     90       112     318.6
27         60    103       132     318.6
91         45    107       137     318.6
118        60    105       125     318.6
141        60     97       127     318.6

In [106]:
df['Calories'].mode()

0    300.0
Name: Calories, dtype: float64

In [107]:
df['Calories'].mode()[0]

np.float64(300.0)

In [108]:
#mode on categorical columns
import pandas as pd 
df = pd.read_csv('data.csv')
z = df['Calories'].mode()[0]
print(z)
df['Calories'].fillna(z,inplace=True)

300.0

C:\Users\HP\AppData\Local\Temp\ipykernel_4180\1935452845.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Calories'].fillna(z,inplace=True)

In [109]:
df[df['Calories'] == z]

     Duration  Pulse  Maxpulse  Calories
5          60    102       127     300.0
16         60    100       120     300.0
17         45     90       112     300.0
22         60    130       101     300.0
27         60    103       132     300.0
36         60    102       127     300.0
37         60    100       120     300.0
38         60    100       120     300.0
47         45    111       136     300.0
77         45    110       141     300.0
85         30    151       170     300.0
91         45    107       137     300.0
118        60    105       125     300.0
141        60     97       127     300.0
165        60    110       145     300.0

### dirtydata.csv

In [110]:
import pandas as pd

df = pd.read_csv('dirtydata.csv')
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [111]:
df.shape

(32, 5)

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  32 non-null     int64
 1   Date      31 non-null     object
 2   Pulse     32 non-null     int64
 3   Maxpulse  32 non-null     int64
 4   Calories  30 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.4+ KB

In [113]:
df['Date'] = pd.to_datetime(df['Date'],format = 'mixed')

In [114]:
df

    Duration       Date  Pulse  Maxpulse  Calories
0         60 2020-12-01    110       130     409.1
1         60 2020-12-02    117       145     479.0
2         60 2020-12-03    103       135     340.0
3         45 2020-12-04    109       175     282.4
4         45 2020-12-05    117       148     406.0
5         60 2020-12-06    102       127     300.0
6         60 2020-12-07    110       136     374.0
7        450 2020-12-08    104       134     253.3
8         30 2020-12-09    109       133     195.1
9         60 2020-12-10     98       124     269.0
10        60 2020-12-11    103       147     329.3
11        60 2020-12-12    100       120     250.7
12        60 2020-12-12    100       120     250.7
13        60 2020-12-13    106       128     345.3
14        60 2020-12-14    104       132     379.3
15        60 2020-12-15     98       123     275.0
16        60 2020-12-16     98       120     215.2
17        60 2020-12-17    100       120     300.0
18        45 2020-12-18     90       112       NaN
19        60 2020-12-19    103       123     323.0
20        45 2020-12-20     97       125     243.0
21        60 2020-12-21    108       131     364.2
22        45        NaT    100       119     282.0
23        60 2020-12-23    130       101     300.0
24        45 2020-12-24    105       132     246.0
25        60 2020-12-25    102       126     334.5
26        60 2020-12-26    100       120     250.0
27        60 2020-12-27     92       118     241.0
28        60 2020-12-28    103       132       NaN
29        60 2020-12-29    100       132     280.0
30        60 2020-12-30    102       129     380.3
31        60 2020-12-31     92       115     243.0

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  32 non-null     int64
 1   Date      31 non-null     datetime64[ns]
 2   Pulse     32 non-null     int64
 3   Maxpulse  32 non-null     int64
 4   Calories  30 non-null     float64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 1.4 KB

In [116]:
df['Date'].fillna('2020-12-22',inplace=True)  # we can drop also

C:\Users\HP\AppData\Local\Temp\ipykernel_4180\2360161987.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Date'].fillna('2020-12-22',inplace=True)  # we can drop also

In [117]:
df

    Duration       Date  Pulse  Maxpulse  Calories
0         60 2020-12-01    110       130     409.1
1         60 2020-12-02    117       145     479.0
2         60 2020-12-03    103       135     340.0
3         45 2020-12-04    109       175     282.4
4         45 2020-12-05    117       148     406.0
5         60 2020-12-06    102       127     300.0
6         60 2020-12-07    110       136     374.0
7        450 2020-12-08    104       134     253.3
8         30 2020-12-09    109       133     195.1
9         60 2020-12-10     98       124     269.0
10        60 2020-12-11    103       147     329.3
11        60 2020-12-12    100       120     250.7
12        60 2020-12-12    100       120     250.7
13        60 2020-12-13    106       128     345.3
14        60 2020-12-14    104       132     379.3
15        60 2020-12-15     98       123     275.0
16        60 2020-12-16     98       120     215.2
17        60 2020-12-17    100       120     300.0
18        45 2020-12-18     90       112       NaN
19        60 2020-12-19    103       123     323.0
20        45 2020-12-20     97       125     243.0
21        60 2020-12-21    108       131     364.2
22        45 2020-12-22    100       119     282.0
23        60 2020-12-23    130       101     300.0
24        45 2020-12-24    105       132     246.0
25        60 2020-12-25    102       126     334.5
26        60 2020-12-26    100       120     250.0
27        60 2020-12-27     92       118     241.0
28        60 2020-12-28    103       132       NaN
29        60 2020-12-29    100       132     280.0
30        60 2020-12-30    102       129     380.3
31        60 2020-12-31     92       115     243.0

In [118]:
import pandas as pd

df = pd.read_csv('dirtydata.csv')
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [119]:
df['Date'] = pd.to_datetime(df['Date'],format = 'mixed')

In [120]:
df.dropna(subset=['Date'])

    Duration       Date  Pulse  Maxpulse  Calories
0         60 2020-12-01    110       130     409.1
1         60 2020-12-02    117       145     479.0
2         60 2020-12-03    103       135     340.0
3         45 2020-12-04    109       175     282.4
4         45 2020-12-05    117       148     406.0
5         60 2020-12-06    102       127     300.0
6         60 2020-12-07    110       136     374.0
7        450 2020-12-08    104       134     253.3
8         30 2020-12-09    109       133     195.1
9         60 2020-12-10     98       124     269.0
10        60 2020-12-11    103       147     329.3
11        60 2020-12-12    100       120     250.7
12        60 2020-12-12    100       120     250.7
13        60 2020-12-13    106       128     345.3
14        60 2020-12-14    104       132     379.3
15        60 2020-12-15     98       123     275.0
16        60 2020-12-16     98       120     215.2
17        60 2020-12-17    100       120     300.0
18        45 2020-12-18     90       112       NaN
19        60 2020-12-19    103       123     323.0
20        45 2020-12-20     97       125     243.0
21        60 2020-12-21    108       131     364.2
23        60 2020-12-23    130       101     300.0
24        45 2020-12-24    105       132     246.0
25        60 2020-12-25    102       126     334.5
26        60 2020-12-26    100       120     250.0
27        60 2020-12-27     92       118     241.0
28        60 2020-12-28    103       132       NaN
29        60 2020-12-29    100       132     280.0
30        60 2020-12-30    102       129     380.3
31        60 2020-12-31     92       115     243.0

In [121]:
north_america = pd.read_csv("north_america_2000_2010.csv")
north_america

,Country,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
0,Canada,1779.0,1771.0,1754.0,1740.0,1760.0,1747,1745.0,1741.0,1735,1701.0,1703.0
1,Mexico,2311.2,2285.2,2271.2,2276.5,2270.6,2281,2280.6,2261.4,2258,2250.2,2242.4
2,USA,1836.0,1814.0,1810.0,1800.0,1802.0,1799,1800.0,1798.0,1792,1767.0,1778.0

In [122]:
south_america = pd.read_csv("south_america_2000_2010.csv")
south_america

  Country  2000  2001  2002  2003  2004  2005  2006  2007  2008  2009    2010
0   Chile  2263  2242  2250  2235  2232  2157  2165  2128  2095  2074  2069.6

In [123]:
americas = pd.concat([north_america,south_america],axis=0) # axis 0 is default(row-wise)
americas

,Country,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
0,Canada,1779.0,1771.0,1754.0,1740.0,1760.0,1747,1745.0,1741.0,1735,1701.0,1703.0
1,Mexico,2311.2,2285.2,2271.2,2276.5,2270.6,2281,2280.6,2261.4,2258,2250.2,2242.4
2,USA,1836.0,1814.0,1810.0,1800.0,1802.0,1799,1800.0,1798.0,1792,1767.0,1778.0
0,Chile,2263.0,2242.0,2250.0,2235.0,2232.0,2157,2165.0,2128.0,2095,2074.0,2069.6

In [124]:
americas.reset_index().drop('index',axis =1)

,Country,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
0,Canada,1779.0,1771.0,1754.0,1740.0,1760.0,1747,1745.0,1741.0,1735,1701.0,1703.0
1,Mexico,2311.2,2285.2,2271.2,2276.5,2270.6,2281,2280.6,2261.4,2258,2250.2,2242.4
2,USA,1836.0,1814.0,1810.0,1800.0,1802.0,1799,1800.0,1798.0,1792,1767.0,1778.0
3,Chile,2263.0,2242.0,2250.0,2235.0,2232.0,2157,2165.0,2128.0,2095,2074.0,2069.6

### Add Column

In [125]:
import pandas as pd

data = {'Name':['jai','princi','gaurav','anuj'],
        'Age':[5.1,6.2,5.1,5.2],
        'Qualification':['msc','mca','mtech','mba']
        }

df = pd.DataFrame(data)
df

     Name  Age Qualification
0     jai  5.1           msc
1  princi  6.2           mca
2  gaurav  5.1         mtech
3    anuj  5.2           mba

In [126]:
address = ['delhi','banglore','chennai','patna']

df['City'] = address
df

     Name  Age Qualification      City
0     jai  5.1           msc     delhi
1  princi  6.2           mca  banglore
2  gaurav  5.1         mtech   chennai
3    anuj  5.2           mba     patna

### Reindexing

In [127]:
import pandas as pd 
import numpy as np

column = ['a','b','c','d','e']
index = ['A','B','C','D','E']

df1 = pd.DataFrame(np.random.rand(5,5),
                    columns= column,index=index)

df1

          a         b         c         d         e
A  0.328773  0.222684  0.262886  0.679780  0.888790
B  0.893576  0.317919  0.719419  0.521618  0.314873
C  0.221099  0.512001  0.477728  0.061579  0.177019
D  0.188789  0.632088  0.966266  0.137690  0.562555
E  0.073185  0.857611  0.972798  0.287829  0.794720

In [128]:
# create the new index for rows
new_index = ['E','A','C','D','B']
print(df1.reindex(new_index))  # axis 0 (row) by default

          a         b         c         d         e
E  0.073185  0.857611  0.972798  0.287829  0.794720
A  0.328773  0.222684  0.262886  0.679780  0.888790
C  0.221099  0.512001  0.477728  0.061579  0.177019
D  0.188789  0.632088  0.966266  0.137690  0.562555
B  0.893576  0.317919  0.719419  0.521618  0.314873

In [129]:
# for columns
column = ['e','a','b','d','c']

print(df1.reindex(column,axis=1))

          e         a         b         d         c
A  0.888790  0.328773  0.222684  0.679780  0.262886
B  0.314873  0.893576  0.317919  0.521618  0.719419
C  0.177019  0.221099  0.512001  0.061579  0.477728
D  0.562555  0.188789  0.632088  0.137690  0.966266
E  0.794720  0.073185  0.857611  0.287829  0.972798

### Time stamp

In [130]:
from datetime import datetime

now = datetime.now() #current data and time
print(now)

2025-07-08 20:42:19.429236

In [131]:
from datetime import datetime
 
now = datetime.now()
print(now)

year = now.strftime("%Y")
print("year:",year)

month = now.strftime("%m")
print("month:",month)

day = now.strftime("%d")
print("day:",day)

time = now.strftime("%H:%M:%S")
print("time:",time)

date_time = now.strftime("%m/%d/%Y , %H:%M:%S")
print(date_time)

2025-07-08 20:42:19.451904
year: 2025
month: 07
day: 08
time: 20:42:19
07/08/2025 , 20:42:19

### Timestamp

In [132]:
timestamp = 1528797322
date_time = datetime.fromtimestamp(timestamp)
date_time

datetime.datetime(2018, 6, 12, 15, 25, 22)

In [133]:
from datetime import datetime

timestamp = 1528797322
date_time = datetime.fromtimestamp(timestamp)

print("Date time object:", date_time)

d = date_time.strftime("%m/%d/%Y, %H:%M:%S")
print("Output 2:", d)

d = date_time.strftime("%d %b, %Y")
print("Output 3:", d)

d = date_time.strftime("%d %B, %Y")
print("Output 4:", d)

d = date_time.strftime("%I%p")
print("Output 5:", d)

Date time object: 2018-06-12 15:25:22
Output 2: 06/12/2018, 15:25:22
Output 3: 12 Jun, 2018
Output 4: 12 June, 2018
Output 5: 03PM

In [134]:
#locale based
from datetime import datetime

timestamp = 1528797322
date_time = datetime.fromtimestamp(timestamp)

d = date_time.strftime("%c")
print("Output 1:", d)

d = date_time.strftime("%x")
print("Output 2:", d)

d = date_time.strftime("%X")
print("Output 3:", d)

Output 1: Tue Jun 12 15:25:22 2018
Output 2: 06/12/18
Output 3: 15:25:22

In [135]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,21.13375,B5,S,2,NaN,"St Louis, MO",2.113375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,15.15500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1.515500

In [139]:
titanic.pivot_table(index='sex', values='fare', aggfunc='mean')

           fare
sex
female  4.61981
male    2.61546